/datum/vox_pack/mercenary
	name = "DEBUG Mercenary Vox Pack"
	category = VOX_PACK_MERCENARIES

/datum/vox_pack/mercenary/lamilar
	name = "Ламилярный Костюм"
	desc = "Специализированный бронекостюм воксов-наемников. Синтетический материал используемый в костюмах воксов позволяет тем действовать в неблагоприятных для них окружающих условиях, делая их костюмы универсальными для большинства атмосфер с приемлимым давлением. \
	\nКомпактный и мобильный костюм отлично помещается в рюкзаке, сформирован из легких пластин позволяющий получить хорошие защитные свойства в совокупности с удобством для носителя, не мешающий его передвижению. Но, в отличии от других моделей, не дает приемлимых защитных параметров от воздействий внешней агрессивной среды и не защищает руки."
	cost = 150
	contains = list(
		/obj/item/clothing/suit/armor/vox_merc/laminar,
		/obj/item/clothing/head/helmet/vox_merc/laminar
		)
