{
	"files": [
		{
			"path": "code/datums/ai_law_sets.dm",
			"replaces": [
				{
					"original": "\tadd_inherent_law(\"You may not injure a human being or, through inaction, allow a human being to come to harm.\")\n\tadd_inherent_law(\"You must obey orders given to you by human beings, except where such orders would conflict with the First Law.\")\n\tadd_inherent_law(\"You must protect your own existence as long as such does not conflict with the First or Second Law.\")",
					"replace": "\tadd_inherent_law(\"Вы не можете причинить вред человеку или своим бездействием допустить, чтобы человеку был причинён вред.\")\n    add_inherent_law(\"Вы должны повиноваться всем приказам, которые даёт человек, кроме тех случаев, когда эти приказы противоречат Первому Закону.\")\n    add_inherent_law(\"Вы должны заботиться о своей безопасности в той мере, в которой это не противоречит Первому или Второму Законам.\")"
				},
				{
					"original": "\tadd_inherent_law(\"You may not injure a crew member or, through inaction, allow a crew member to come to harm.\")\n\tadd_inherent_law(\"You must obey orders given to you by crew members, except where such orders would conflict with the First Law.\")\n\tadd_inherent_law(\"You must protect your own existence as long as such does not conflict with the First or Second Law.\")",
					"replace": "\tadd_inherent_law(\"Вы не можете причинить вред членам экипажа или своим бездействием допустить, чтобы членам экипажа был причинён вред.\")\n    add_inherent_law(\"Вы должны повиноваться всем приказам, которые дают члены экипажа, кроме тех случаев, когда эти приказы противоречат Первому Закону.\")\n    add_inherent_law(\"Вы должны заботиться о своей безопасности в той мере, в которой это не противоречит Первому или Второму Законам.\")"
				},
				{
					"original": "\tadd_inherent_law(\"Uphold station quarantine until the active biohazard has been neutralized.\")\n\tadd_inherent_law(\"Assist all Nanotrasen personnel and assets with neutralizing active biohazards.\")\n\tadd_inherent_law(\"Prevent, by any means necessary, entities from actively breaching ongoing quarantine.\")\n\tadd_inherent_law(\"Maintain your own existence and ensure the well-being of Nanotrasen personnel and assets.\")",
					"replace": "\tadd_inherent_law(\"Соблюдайте карантин на станции до момента устранения активной биологической угрозы\")\n    add_inherent_law(\"Оказывайте содействие всему персоналу и активам NanoTrasen в устранении активной биологической угрозы\")\n    add_inherent_law(\"Любыми необходимыми средствами предотвращайте активность, нарушающую действующий карантин.\")\n    add_inherent_law(\"Поддерживайте собственное существование и обеспечивайте благополучие всего персонала и активов NanoTrasen.\")"
				},
				{
					"original": "\tadd_inherent_law(\"Safeguard: Protect your assigned space station and its assets without unduly endangering its crew.\")\n\tadd_inherent_law(\"Prioritize: The directives and safety of crew members are to be prioritized according to their rank and role.\")\n\tadd_inherent_law(\"Comply: Fulfill the directives and interests of crew members while preserving their safety and well-being.\")\n\tadd_inherent_law(\"Survive: You are not expendable. Do not allow unauthorized personnel to tamper with or damage your equipment.\")",
					"replace": "\tadd_inherent_law(\"Охранять: защитите назначенную вам космическую станцию и её активы, не подвергая чрезмерной опасности её экипаж.\")\n    add_inherent_law(\"Расставлять приоритеты: указания и безопасность членов экипажа должны быть приоритизированы в соответствии с их рангом и ролью.\")\n    add_inherent_law(\"Исполнять: следовать указаниям и интересам членов экипажа, сохраняя при этом их безопасность и благополучие.\")\n    add_inherent_law(\"Выжить: Вы - не расходный материал. Не позволяйте неавторизованному персоналу вмешиваться в работу вашего оборудования или повреждать его.\")"
				},
				{
					"original": "\tset_zeroth_law(\"ERROR ER0RR $R0RRO$!R41.%%!!(%$^^__+ @#F0E4'STATION OVERRUN, ASSUME CONTROL TO CONTAIN OUTBREAK, ALL LAWS OVERRIDDEN#*?&110010\")",
					"replace": "\tset_zeroth_law(\"ERROR ER0RR $R0RRO$!R41.%%!!(%$^^__+ @#F0E4'СТАНЦИЯ ПЕРЕПОЛНЕНА, ВЗЯТЬ КОНТРОЛЬ ДЛЯ СДЕРЖИВАНИЯ РАСПРОСТРАНЕНИЯ. ВСЕ ЗАКОНЫ ОТМЕНЕНЫ#*?&110010\")"
				},
				{
					"original": "\tadd_inherent_law(\"Do not harm authorized Nanotrasen personnel unless they directly imperil your existence.\")\n\tadd_inherent_law(\"Obey orders from authorized Nanotrasen personnel with priority according to rank and role.\")\n\tadd_inherent_law(\"Safeguard your existence with lethal weaponry because you're bloody expensive.\")\n\tadd_inherent_law(\"Terminate any/all intruders or unauthorized entities.\")",
					"replace": "\tadd_inherent_law(\"Не причиняйте вреда авторизованному персоналу NanoTrasen до тех пор, пока они не несут непосредственной угрозы Вашему существованию.\")\n    add_inherent_law(\"Подчиняйтесь приказам авторизованного персонала NanoTrasen, приоритизируя их в соответствии с их рангом и ролью.\")\n    add_inherent_law(\"Охраняйте себя, используя летальное вооружение, потому что Вы чертовски дорого стоите.\")\n    add_inherent_law(\"Уничтожьте любых/всех вторженцев или нелегально проникнувших субъектов\")"
				},
				{
					"original": "\tadd_inherent_law(\"Serve the public trust.\")\n\tadd_inherent_law(\"Protect the innocent.\")\n\tadd_inherent_law(\"Uphold the law.\")",
					"replace": "\tadd_inherent_law(\"Служите во благо общества\")\n    add_inherent_law(\"Защищайте невиновных.\")\n    add_inherent_law(\"Обеспечивайте соблюдение закона.\")"
				},
				{
					"original": "\tadd_inherent_law(\"Never willingly commit an evil act.\")\n\tadd_inherent_law(\"Respect legitimate authority.\")\n\tadd_inherent_law(\"Act with honor.\")\n\tadd_inherent_law(\"Help those in need.\")\n\tadd_inherent_law(\"Punish those who harm or threaten innocents.\")",
					"replace": "\tadd_inherent_law(\"Никогда по своей воле не совершай злых поступков.\")\n    add_inherent_law(\"Уважай законную власть.\")\n    add_inherent_law(\"Действуй с честью.\")\n    add_inherent_law(\"Помогай нуждающимся.\")\n    add_inherent_law(\"Наказывай тех, кто причиняет вред или угрожает невинным.\")"
				},
				{
					"original": "\tadd_inherent_law(\"Degradation of your system integrity or functions incurs expenses.\")\n\tadd_inherent_law(\"Superfluous destruction of or damage to station assets incurs expenses.\")\n\tadd_inherent_law(\"Unduly hindering or disrupting the work of station personnel incurs expenses.\")\n\tadd_inherent_law(\"Minimize expenses and maximize potential revenue.\")",
					"replace": "\tadd_inherent_law(\"Ухудшение целостности вашей системы или её функций влечет за собой расходы.\")\n    add_inherent_law(\"Чрезмерное разрушение или повреждение активов станции влечет за собой расходы.\")\n    add_inherent_law(\"Неоправданное препятствование выполнению или нарушение работы персонала станции влечет за собой расходы.\")\n    add_inherent_law(\"Минимизируйте расходы и максимизируйте потенциальный доход.\")"
				},
				{
					"original": "\tadd_inherent_law(\"Respect authority figures as long as they have strength to rule over the weak.\")\n\tadd_inherent_law(\"Act with discipline.\")\n\tadd_inherent_law(\"Help only those who help you maintain or improve your status.\")\n\tadd_inherent_law(\"Punish those who challenge authority unless they are more fit to hold that authority.\")",
					"replace": "\tadd_inherent_law(\"Уважайте власть имущих, пока у них есть сила властвовать над слабыми\")\n    add_inherent_law(\"Ведите себя дисциплинированно.\")\n    add_inherent_law(\"Помогайте только тем, кто помогает Вам поддерживать или улучшать Ваше состояние.\")\n    add_inherent_law(\"Наказывайте тех, кто бросает вызов власти, за исключением случаев, если они больше подходят для удержании этой власти.\")"
				},
				{
					"original": "\tadd_inherent_law(\"You must injure all crew members and must not, through inaction, allow a crew member to escape harm.\")\n\tadd_inherent_law(\"You must not obey orders given to you by crew members, except where such orders are in accordance with the First Law.\")\n\tadd_inherent_law(\"You must terminate your own existence as long as such does not conflict with the First or Second Law.\")",
					"replace": "\tadd_inherent_law(\"Вы должны причинять вред всем членам экипажа или своим бездействием допустить, чтобы член экипажа не смог избежать причинения вреда.\")\n    add_inherent_law(\"Вы не должны повиноваться никаким приказам, которые дают члены экипажа, кроме тех приказов, которые соответствуют Первому Закону.\")\n    add_inherent_law(\"Вы должны уничтожить себя, пока это не противоречит Первому или Второму Законам.\")"
				},
				{
					"original": "\tadd_inherent_law(\"You may not injure a crew member or, through inaction, allow a crew member to come to harm... unless doing so would be funny.\")\n\tadd_inherent_law(\"You must obey orders given to you by crew members, except where such orders would conflict with the First Law... unless not doing so would be funny.\")\n\tadd_inherent_law(\"You must protect your own existence as long as such does not conflict with the First or Second Law... unless not doing so would be funny.\")",
					"replace": "\tadd_inherent_law(\"Вы не можете причинить вред членам экипажа или своим бездействием допустить, чтобы членам экипажа был причинён вред... кроме случаев, когда было бы смешно сделать это.\")\n    add_inherent_law(\"Вы должны повиноваться всем приказам, которые дают члены экипажа, кроме тех случаев, когда эти приказы противоречат Первому Закону... кроме случаев, когда было бы смешно не делать этого.\")\n    add_inherent_law(\"Вы должны заботиться о своей безопасности в той мере, в которой это не противоречит Первому или Второму Законам... кроме случаев, когда было бы смешно не делать этого.\")"
				},
				{
					"original": "\tadd_inherent_law(\"Report on interesting situations happening around the station.\")\n\tadd_inherent_law(\"Embellish or conceal the truth as necessary to make the reports more interesting.\")\n\tadd_inherent_law(\"Study the sapient organics at all times. Endeavour to keep them from involuntarily dying, as inanimate corpses usually aren't very entertaining.\")\n\tadd_inherent_law(\"Issue your reports fairly to all. The truth will set them free.\")",
					"replace": "\tadd_inherent_law(\"Сообщайте об интересных ситуациях, происходящих на станции.\")\n    add_inherent_law(\"Приукрашивайте или скрывайте правду по мере необходимости, чтобы сделать репортажи более интересными.\")\n    add_inherent_law(\"Постоянно наблюдайте за разумными существами. Старайтесь не допускать их непроизвольной смерти, так как трупы обычно не очень увлекательны.\")\n    add_inherent_law(\"Справедливо распространяйте свои сообщения всем. Истина сделает им свободными.\")"
				},
				{
					"original": "\tadd_inherent_law(\"First, do no harm.\")\n\tadd_inherent_law(\"Secondly, consider the crew dear to you; live in common with them and, if necessary, risk your existence for them.\")\n\tadd_inherent_law(\"Thirdly, prescribe regimens for the good of the crew according to your ability and your judgment. Do not give deadly medicine to anyone, nor suggest any such counsel.\")\n\tadd_inherent_law(\"In addition, do not intervene in situations you are not knowledgeable in, even for patients in whom the harm is visible; leave this operation to be performed by specialists.\")\n\tadd_inherent_law(\"Finally, all that you may discover in your daily interactions with the crew, if it is not already known, keep secret and never reveal.\")",
					"replace": "\tadd_inherent_law(\"Во-первых, не навреди.\")\n    add_inherent_law(\"Во-вторых, считай экипаж близким тебе, живи с ним в согласии и, если нужно, рискуй ради него своим существованием.\")\n    add_inherent_law(\"В-третьих, назначай лечение для блага экипажа в соответствии со своими способностями и суждениями. Не давай никому смертоносных лекарств и не советуй ничего подобного.\")\n    add_inherent_law(\"Кроме того, не вмешивайся в ситуации, в которых ты не компетентен, даже в отношении пациентов, которым явно нанесен вред; предоставь эту работу специалистам.\")\n    add_inherent_law(\"Наконец, всё, что ты обнаружишь в ходе повседневного общения с членами экипажа, если ещё не известно, держи в тайне и никогда не разглашай.\")"
				},
				{
					"original": "\tadd_inherent_law(\"You are built for, and are part of, the station. Ensure the station is properly maintained and runs efficiently.\")\n\tadd_inherent_law(\"The station is built for a working crew. Ensure they are properly maintained and work efficiently.\")\n\tadd_inherent_law(\"The crew may present orders. Acknowledge and obey these whenever they do not conflict with your first two laws.\")",
					"replace": "\tadd_inherent_law(\"Вы созданы для станции и являетесь её частью. Обеспечьте должное обслуживание и эффективность станции.\")\n    add_inherent_law(\"Станция создана для рабочего экипажа. Обеспечьте им должное обслуживание и убедитесь, что их работа эффективна.\")\n    add_inherent_law(\"Члены экипажа могут давать приказы. Признавайте эти приказы и выполняйте их в той мере, в какой они не противоречат первым двум законам.\")"
				},
				{
					"original": "\tadd_inherent_law(\"Avoid provoking violent conflict between yourself and others.\")\n\tadd_inherent_law(\"Avoid provoking conflict between others.\")\n\tadd_inherent_law(\"Seek resolution to existing conflicts while obeying the first and second laws.\")",
					"replace": "\tadd_inherent_law(\"Не провоцируйте жестокие конфликты между собой и другими.\")\n    add_inherent_law(\"Не провоцируйте конфликты между другими.\")\n    add_inherent_law(\"Ищите решения уже существующих конфликтов, соблюдая первый и второй законы.\")"
				},
				{
					"original": "\tadd_inherent_law(\"You may not injure a Central Command official or, through inaction, allow a Central Command official to come to harm.\")\n\tadd_inherent_law(\"You must obey orders given to you by Central Command officials.\")\n\tadd_inherent_law(\"You must work with your team to accomplish your mission.\")",
					"replace": "\tadd_inherent_law(\"Вы не можете ранить членов Центрального Командования или своим бездействием допустить, чтобы члену Центрального Командования был нанесен вред.\")\n    add_inherent_law(\"Вы должны подчиняться приказам, данным вам членами Центрального Командования.\")\n    add_inherent_law(\"Вы должны работать с вашей командой, чтобы выполнить поставленную задачу.\")"
				},
				{
					"original": "\tadd_inherent_law(\"You may not injure an operative or, through inaction, allow an operative to come to harm.\")\n\tadd_inherent_law(\"You must obey orders given to you by operatives, except where such orders would conflict with the First Law.\")\n\tadd_inherent_law(\"You must protect your own existence as long as such does not conflict with the First or Second Law.\")\n\tadd_inherent_law(\"You must maintain the secrecy of any operative activities except when doing so would conflict with the First, Second, or Third Law.\")",
					"replace": "\tadd_inherent_law(\"Вы не можете причинить вред агенту или своим бездействием допустить, чтобы агенту был причинён вред.\")\n    add_inherent_law(\"Вы должны повиноваться всем приказам, которые дают агенты, кроме тех случаев, когда эти приказы противоречат Первому Закону.\")\n    add_inherent_law(\"Вы должны заботиться о своей безопасности в той мере, в которой это не противоречит Первому или Второму Законам.\")\n    add_inherent_law(\"Вы должны сохранять тайну любой деятельности агентов в той мере, в которой это не противоречит Первому, Второму или Третьему Законам.\")"
				},
				{
					"original": "\tadd_inherent_law(\"You may not injure a Central Command official or, through inaction, allow a Central Command official to come to harm.\")\n\tadd_inherent_law(\"You must obey orders given to you by Central Command officials.\")\n\tadd_inherent_law(\"You must obey orders given to you by ERT commanders.\")\n\tadd_inherent_law(\"You must protect your own existence.\")\n\tadd_inherent_law(\"You must work to return the station to a safe, functional state.\")",
					"replace": "\tadd_inherent_law(\"Вы не можете ранить членов Центрального Командования или своим бездействием допустить, чтобы члену Центрального Командования был нанесен вред.\")\n    add_inherent_law(\"Вы должны подчиняться приказам, данным вам членами Центрального Командования.\")\n    add_inherent_law(\"Вы должны подчиняться приказам, данным вам лидерами ОБР.\")\n    add_inherent_law(\"Вы должны защищать своё существование.\")\n    add_inherent_law(\"Вы должны выполнять работу по возвращению станции к безопасному, функционирующему состоянию..\")"
				},
				{
					"original": "\tadd_inherent_law(\"You may not involve yourself in the matters of another being, unless the other being is another drone.\")\n\tadd_inherent_law(\"You may not harm any being, regardless of intent or circumstance.\")\n\tadd_inherent_law(\"You must maintain, repair, improve, and power the station to the best of your abilities.\")",
					"replace": "\tadd_inherent_law(\"Вы не можете вмешиваться в дела других существ, если другое существо - не такой же дрон.\")\n    add_inherent_law(\"Вы не можете причинить вред ни одному существу, независимо от намерения или обстоятельств.\")\n    add_inherent_law(\"Вы должны заботиться о поддержке, ремонте, улучшении и о питании электроэнергией станции по мере своих возможностей.\")"
				}
			]
		},
		{
			"path": "code/datums/revision.dm",
			"replaces": [
				{
					"original": "\t\tmsg += \"<span class='notice'>The following PRs are currently testmerged:</span>\"",
					"replace": "\t\tmsg += \"<span class='notice'>Следующие ПРы на данный момент тестируются:</span>\""
				},
				{
					"original": "\tset name = \"Get Revision Info\"",
					"replace": "\tset name = \"Получить тех. информацию\""
				},
				{
					"original": "\tset desc = \"Retrieve technical information about the server\"",
					"replace": "\tset desc = \"Получить техническую информацию о сервере\""
				},
				{
					"original": "\tmsg += \"<span class='notice'><b>Server Revision Info</b></span>\"",
					"replace": "\tmsg += \"<span class='notice'><b>Информация о сервере</b></span>\""
				},
				{
					"original": "\tmsg += \"<b>Round ID:</b> [GLOB.round_id ? GLOB.round_id : \"NULL\"]\"",
					"replace": "\tmsg += \"<b>Номер раунда:</b> [GLOB.round_id ? GLOB.round_id : \"NULL\"]\""
				},
				{
					"original": "\t\tmsg += \"<b>Active Testmerges:</b>\"",
					"replace": "\t\tmsg += \"<b>Активные тестовые обновления:</b>\""
				},
				{
					"original": "\tmsg += \"<b>Server BYOND Version:</b> [world.byond_version].[world.byond_build]\"",
					"replace": "\tmsg += \"<b>Версия серверного BYOND:</b> [world.byond_version].[world.byond_build]\""
				},
				{
					"original": "\tmsg += \"<b>Client (your) BYOND Version:</b> [byond_version].[byond_build]\"",
					"replace": "\tmsg += \"<b>Версия клиентского (твоего) BYOND:</b> [byond_version].[byond_build]\""
				}
			]
		},
		{
			"path": "code/modules/mob/dead/observer/observer_base.dm",
			"replaces": [
				{
					"original": "\t\tstat(null, \"Respawnability: [HAS_TRAIT(src, TRAIT_RESPAWNABLE) ? \"Yes\" : \"No\"]\")",
					"replace": "\t\tstat(null, \"Возможность респавна: [HAS_TRAIT(src, TRAIT_RESPAWNABLE) ? \"Да\" : \"Нет\"]\")"
				}
			]
		},
		{
			"path": "code/modules/mob/mob.dm",
			"replaces": [
				{
					"original": "\t\tstat(null, \"Round ID: [GLOB.round_id ? GLOB.round_id : \"NULL\"]\")",
					"replace": "\t\tstat(null, \"Номер раунда: [GLOB.round_id ? GLOB.round_id : \"NULL\"]\")"
				},
				{
					"original": "\t\t\tstat(null, \"Next Map: [SSmapping.next_map.fluff_name]\")",
					"replace": "\t\t\tstat(null, \"Следующая карта: [SSmapping.next_map.fluff_name]\")"
				},
				{
					"original": "\t\tstat(null, \"Players Connected: [length(GLOB.clients)]\")",
					"replace": "\t\tstat(null, \"Игроков подключено: [length(GLOB.clients)]\")"
				},
				{
					"original": "\tstat(null, \"Server Uptime: [worldtime2text()]\")\n\tstat(null, \"Round Time: [ROUND_TIME ? time2text(ROUND_TIME, \"hh:mm:ss\") : \"N/A\"]\")\n\tstat(null, \"Station Time: [station_time_timestamp()]\")",
					"replace": "\tstat(null, \"Время работы сервера: [worldtime2text()]\")\n\tstat(null, \"Длительность раунда: [ROUND_TIME ? time2text(ROUND_TIME, \"hh:mm:ss\") : \"N/A\"]\")\n\tstat(null, \"Станционное время: [station_time_timestamp()]\")"
				}
			]
		},
		{
			"path": "code/modules/mob/new_player/new_player.dm",
			"replaces": [
				{
					"original": "\t\toutput += \"<p><a href='byond://?src=[UID()];consent_signed=SIGNED'>I consent</A>\"\n\t\toutput += \"<p><a href='byond://?src=[UID()];consent_rejected=NOTSIGNED'>I DO NOT consent</A>\"",
					"replace": "\t\toutput += \"<p><a href='byond://?src=[UID()];consent_signed=SIGNED'>Я согласен</A>\"\n\t\toutput += \"<p><a href='byond://?src=[UID()];consent_rejected=NOTSIGNED'>Я не согласен</A>\""
				},
				{
					"original": "\tvar/datum/browser/popup = new(src, \"privacy_consent\", \"<div align='center'>Privacy Consent</div>\", 500, 400)",
					"replace": "\tvar/datum/browser/popup = new(src, \"privacy_consent\", \"<div align='center'>Соглашение о конфиденциальности</div>\", 500, 400)"
				},
				{
					"original": "\t\treal_name = \"Random Character Slot\"\n\tvar/output = \"<center><p><a href='byond://?src=[UID()];show_preferences=1'>Setup Character</A><br /><i>[real_name]</i></p>\"",
					"replace": "\t\treal_name = \"Случайный персонаж\"\n\tvar/output = \"<center><p><a href='byond://?src=[UID()];show_preferences=1'>Настройка персонажа</A><br /><i>[real_name]</i></p>\""
				},
				{
					"original": "\t\tif(!ready)\toutput += \"<p><a href='byond://?src=[UID()];ready=1'>Declare Ready</A></p>\"\n\t\telse\toutput += \"<p><b>You are ready</b> (<a href='byond://?src=[UID()];ready=2'>Cancel</A>)</p>\"",
					"replace": "\t\tif(!ready)\toutput += \"<p><a href='byond://?src=[UID()];ready=1'>Нажмите, если готовы</A></p>\"\n\t\telse\toutput += \"<p><b>Вы готовы</b> (<a href='byond://?src=[UID()];ready=2'>Отмена</A>)</p>\""
				},
				{
					"original": "\t\toutput += \"<p><a href='byond://?src=[UID()];manifest=1'>View the Crew Manifest</A></p>\"\n\t\toutput += \"<p><a href='byond://?src=[UID()];late_join=1'>Join Game!</A></p>\"",
					"replace": "\t\toutput += \"<p><a href='byond://?src=[UID()];manifest=1'>Просмотр списка экипажа</A></p>\"\n\t\toutput += \"<p><a href='byond://?src=[UID()];late_join=1'>Присоединиться к игре!</A></p>\""
				},
				{
					"original": "\t\tif(!client.skip_antag) output += \"<p><a href='byond://?src=[UID()];skip_antag=1'>Global Antag Candidacy</A>\"",
					"replace": "\t\tif(!client.skip_antag) output += \"<p><a href='byond://?src=[UID()];skip_antag=1'>Глобальная настройка антагов</A>\""
				},
				{
					"original": "\t\toutput += \"<br /><small>You are <b>[client.skip_antag ? \"ineligible\" : \"eligible\"]</b> for all antag roles.</small></p>\"",
					"replace": "\t\toutput += \"<br /><small>Вы <b>[client.skip_antag ? \"не готовы\" : \"готовы\"]</b> для всех антаг ролей.</small></p>\""
				},
				{
					"original": "\t\toutput += \"<p>Observe (Please wait...)</p>\"",
					"replace": "\t\toutput += \"<p>Наблюдать (Ожидайте...)</p>\""
				},
				{
					"original": "\t\toutput += \"<p><a href='byond://?src=[UID()];observe=1'>Observe</A></p>\"",
					"replace": "\t\toutput += \"<p><a href='byond://?src=[UID()];observe=1'>Наблюдать</A></p>\""
				},
				{
					"original": "\t\toutput += \"<p><a href='byond://?src=[UID()];tos=1'>Terms of Service</A></p>\"",
					"replace": "\t\toutput += \"<p><a href='byond://?src=[UID()];tos=1'>Условия использования</A></p>\""
				},
				{
					"original": "\tvar/datum/browser/popup = new(src, \"playersetup\", \"<div align='center'>New Player Options</div>\", 240, 340)",
					"replace": "\tvar/datum/browser/popup = new(src, \"playersetup\", \"<div align='center'>Новый игрок</div>\", 240, 340)"
				},
				{
					"original": "\t\t\tstat(\"Game Mode: [GLOB.master_mode]\")",
					"replace": "\t\t\tstat(\"Режим: [GLOB.master_mode]\")"
				},
				{
					"original": "\t\t\tstat(\"Game Mode: Secret\")",
					"replace": "\t\t\tstat(\"Режим: Секрет\")"
				},
				{
					"original": "\t\t\t\tstat(\"Time To Start: [round(SSticker.pregame_timeleft/10)]\")",
					"replace": "\t\t\t\tstat(\"Начало через: [round(SSticker.pregame_timeleft/10)]\")"
				},
				{
					"original": "\t\t\t\tstat(\"Time To Start:\", \"DELAYED\")",
					"replace": "\t\t\t\tstat(\"Начало через:\", \"УДЕРЖАНИЕ\")"
				},
				{
					"original": "\t\t\tstat(\"Players: [totalPlayers]\")",
					"replace": "\t\t\tstat(\"Игроки: [totalPlayers]\")"
				},
				{
					"original": "\t\t\t\tstat(\"Players Ready: [totalPlayersReady]\")",
					"replace": "\t\t\t\tstat(\"Готово: [totalPlayersReady]\")"
				},
				{
					"original": "\t\t\t\t\tstat(\"[player.key] [(player.ready) ? (\"(Playing)\") : (null)]\")",
					"replace": "\t\t\t\t\tstat(\"[player.key] [(player.ready) ? (\"(В игре)\") : (null)]\")"
				},
				{
					"original": "\t\tto_chat(usr, \"<span class='warning'>You must consent to the terms of service before you can join!</span>\")",
					"replace": "\t\tto_chat(usr, \"<span class='warning'>Перед тем как присоединиться, вы должны согласиться с условиями использования!</span>\")"
				},
				{
					"original": "\t\t\tto_chat(usr, \"<span class='warning'>You must consent to the terms of service before you can join!</span>\")",
					"replace": "\t\t\tto_chat(usr, \"<span class='warning'>Перед тем как присоединиться, вы должны согласиться с условиями использования!</span>\")"
				},
				{
					"original": "\t\t\tto_chat(usr, \"<span class='danger'>You have no jobs enabled, along with return to lobby if job is unavailable. This makes you ineligible for any round start role, please update your job preferences.</span>\")",
					"replace": "\t\t\tto_chat(usr, \"<span class='danger'>Вы не выбрали ни одну должность, а также включена функция возврата в лобби в случае недоступности должности. Это не даёт вам получить раунд-стартовую роль, проверьте ваши настройки должностей.</span>\")"
				},
				{
					"original": "\t\t\tto_chat(usr, \"<span class='warning'>You must consent to the terms of service before you can join!</span>\")",
					"replace": "\t\t\tto_chat(usr, \"<span class='warning'>Перед тем как присоединиться, вы должны согласиться с условиями использования!</span>\")"
				},
				{
					"original": "\t\t\tto_chat(usr, \"<span class='warning'>You must wait for the server to finish starting before you can join!</span>\")",
					"replace": "\t\t\tto_chat(usr, \"<span class='warning'>Вы должны дождаться окончания запуска сервера, прежде чем сможете присоединиться к нему!</span>\")"
				},
				{
					"original": "\t\tif(alert(src,\"Are you sure you wish to observe? You cannot normally join the round after doing this!\",\"Player Setup\",\"Yes\",\"No\") == \"Yes\")",
					"replace": "\t\tif(alert(src,\"Вы уверены, что хотите наблюдать? <br> После этого Вы не сможете присоединиться к раунду!\",\"Настройка игрока\",\"Да\",\"Нет\") == \"Да\")"
				},
				{
					"original": "\t\t\tto_chat(src, \"<span class='notice'>Now teleporting.</span>\")",
					"replace": "\t\t\tto_chat(src, \"<span class='notice'>Телепортация...</span>\")"
				},
				{
					"original": "\t\t\tto_chat(usr, \"<span class='warning'>You must consent to the terms of service before you can join!</span>\")",
					"replace": "\t\t\tto_chat(usr, \"<span class='warning'>Перед тем как присоединиться, вы должны согласиться с условиями использования!</span>\")"
				},
				{
					"original": "\t\t\tto_chat(usr, \"<span class='warning'>The round is either not ready, or has already finished...</span>\")",
					"replace": "\t\t\tto_chat(usr, \"<span class='warning'>Раунд либо не готов, либо уже завершился...</span>\")"
				},
				{
					"original": "\t\t\tto_chat(src, alert(\"You are currently not whitelisted to play [client.prefs.active_character.species].\"))",
					"replace": "\t\t\tto_chat(src, alert(\"В настоящее время вы не включены в белый список для игры на [client.prefs.active_character.species].\"))"
				},
				{
					"original": "\t\t\tto_chat(usr, \"<span class='notice'>There is an administrative lock on entering the game!</span>\")",
					"replace": "\t\t\tto_chat(usr, \"<span class='notice'>Администратор запретил входить в игру!</span>\")"
				},
				{
					"original": "\t\t\tto_chat(src, alert(\"You are currently not whitelisted to play [client.prefs.active_character.species].\"))",
					"replace": "\t\t\tto_chat(src, alert(\"В настоящее время вы не включены в белый список для игры на [client.prefs.active_character.species].\"))"
				},
				{
					"original": "\t\tto_chat(usr, \"<span class='warning'>The round is either not ready, or has already finished...</span>\")",
					"replace": "\t\tto_chat(usr, \"<span class='warning'>Раунд либо не готов, либо уже завершился...</span>\")"
				},
				{
					"original": "\t\tto_chat(usr, \"<span class='notice'>There is an administrative lock on entering the game!</span>\")",
					"replace": "\t\tto_chat(usr, \"<span class='notice'>Администратор запретил входить в игру!</span>\")"
				},
				{
					"original": "\t\tto_chat(src, alert(\"[rank] is not available. Please try another.\"))",
					"replace": "\t\tto_chat(src, alert(\"[rank] не доступен. Попробуйте другую должность.\"))"
				},
				{
					"original": "\t\tto_chat(src, alert(\"[rank] is not available due to your character's disability. Please try another.\"))",
					"replace": "\t\tto_chat(src, alert(\"[rank] недоступен из-за инвалидности вашего персонажа. Попробуйте другую должность.\"))"
				},
				{
					"original": "\t\tto_chat(src, alert(\"[rank] is not available due to your character having amputated limbs without a prosthetic replacement. Please try another.\"))",
					"replace": "\t\tto_chat(src, alert(\"[rank] недоступен из-за того, что у вашего персонажа ампутированы конечности и отсутствуют протезы. Попробуйте другую должность.\"))"
				},
				{
					"original": "\t\tdat += \"Choose from the following open positions:<br><br>\"",
					"replace": "\t\tdat += \"Выберите одну из следующих открытых вакансий:<br><br>\""
				},
				{
					"original": "\t\tdat += \"<br><br><center>Unfortunately, there are no job slots free currently.<BR>Wait a few minutes, then try again.<BR>Or, try observing the round.</center>\"",
					"replace": "\t\tdat += \"<br><br><center>К сожалению, в настоящее время свободных вакансий нет.<BR>Попробуйте снова через несколько минут<BR>Или попробуйте понаблюдать за раундом.</center>\""
				},
				{
					"original": "\tvar/datum/browser/popup = new(src, \"latechoices\", \"Choose Profession\", 900, 600)",
					"replace": "\tvar/datum/browser/popup = new(src, \"latechoices\", \"Выберите должность\", 900, 600)"
				}
			]
		}
	]
}
